In [1]:
import pandas as pd

### EXTRACT ###

#### Read data ####

In [2]:
raw_data = pd.read_csv('../data/Sales Dataset.csv')

In [3]:
raw_data.head()

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode,Order Date,CustomerName,State,City,Year-Month
0,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
1,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12
2,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2021-07-25,Robert Stone,New York,Buffalo,2021-07
3,B-26776,4975,1330,14,Electronics,Printers,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
4,B-26776,4975,1330,14,Electronics,Printers,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12

In [138]:
#convert Order Date to date
raw_data['Order_Date_conv'] = pd.to_datetime(raw_data['Order Date'])
raw_data.head()

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode,Order Date,CustomerName,State,City,Year-Month,Order_Date_conv
0,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06,2023-06-27
1,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12,2024-12-27
2,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2021-07-25,Robert Stone,New York,Buffalo,2021-07,2021-07-25
3,B-26776,4975,1330,14,Electronics,Printers,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06,2023-06-27
4,B-26776,4975,1330,14,Electronics,Printers,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12,2024-12-27

### TRANSFORM ###

#### dim_customers table ####

In [114]:
def create_dim_customer(df):
    dim_customer = df[['CustomerName']].drop_duplicates()
    dim_customer.reset_index(drop = True, inplace = True)
    dim_customer['customer_id'] = dim_customer.index + 1
    dim_customer.rename(columns = {'CustomerName' : 'customer_name'}, inplace=True)

    return dim_customer

In [115]:
create_dim_customer(raw_data).head()

   customer_name  customer_id
0  David Padilla            1
1  Connor Morgan            2
2   Robert Stone            3
3    John Fields            4
4  Clayton Smith            5

#### dim_product table ####

In [116]:
def create_dim_product(df):
    dim_product = df[['Sub-Category', 'Category']].drop_duplicates()
    dim_product.reset_index(drop=True, inplace = True)
    dim_product['product_id'] = dim_product.index + 1
    dim_product.rename(columns = {'Sub-Category' : 'sub_category', 'Category' : 'category'}, inplace = True)

    return dim_product

In [117]:
create_dim_product(raw_data).head()

       sub_category         category  product_id
0  Electronic Games      Electronics           1
1          Printers      Electronics           2
2              Pens  Office Supplies           3
3           Laptops      Electronics           4
4            Tables        Furniture           5

#### dim_date table ####

In [143]:
def create_dim_date(df):
    dim_date = df[['Order_Date_conv']].drop_duplicates()
    dim_date.reset_index(drop=True, inplace = True)
    dim_date['date_id'] = dim_date.index + 1
    dim_date['year'] = dim_date['Order_Date_conv'].dt.year
    dim_date['quarter'] = dim_date['Order_Date_conv'].dt.quarter
    dim_date['month'] = dim_date['Order_Date_conv'].dt.month
    dim_date.rename(columns = {'Order_Date_conv' : 'date'}, inplace = True)

    return dim_date

In [144]:
create_dim_date(raw_data).head()

        date  date_id  year  quarter  month
0 2023-06-27        1  2023        2      6
1 2024-12-27        2  2024        4     12
2 2021-07-25        3  2021        3      7
3 2024-05-11        4  2024        2      5
4 2021-10-09        5  2021        4     10

#### dim_payment_method table ####

In [145]:
def create_dim_payment_mode(df):
    dim_payment_mode = df[['PaymentMode']].drop_duplicates()
    dim_payment_mode.reset_index(drop=True, inplace = True)
    dim_payment_mode['payment_mode_id'] = dim_payment_mode.index + 1
    dim_payment_mode.rename(columns = {'PaymentMode' : 'payment_mode'}, inplace = True)

    return dim_payment_mode

In [146]:
create_dim_payment_mode(raw_data).head()

  payment_mode  payment_mode_id
0          UPI                1
1   Debit Card                2
2          EMI                3
3  Credit Card                4
4          COD                5

#### dim_location table ####

In [147]:
def create_dim_location(df):
    dim_location = df[['State', 'City']].drop_duplicates()
    dim_location.reset_index(drop=True, inplace = True)
    dim_location['location_id'] = dim_location.index + 1
    dim_location.rename(columns = {'State' : 'state', 'City' : 'city'}, inplace = True)

    return dim_location

In [148]:
create_dim_location(raw_data).head()

        state         city  location_id
0     Florida        Miami            1
1    Illinois      Chicago            2
2    New York      Buffalo            3
3     Florida      Orlando            4
4  California  Los Angeles            5

#### Create final dataframes ####

In [167]:
fact_table = raw_data
dim_customer = create_dim_customer(raw_data)
dim_product = create_dim_product(raw_data)
dim_date = create_dim_date(raw_data)
dim_payment_mode = create_dim_payment_mode(raw_data)
dim_location = create_dim_location(raw_data)

In [168]:
#change actual data in fact table to dimensional tables keys
fact_table = fact_table.merge(dim_customer, how='left', left_on=['CustomerName'], right_on=['customer_name'], suffixes = ('', ''))
fact_table = fact_table.merge(dim_product, how='left', left_on=['Sub-Category', 'Category'], right_on=['sub_category', 'category'])
fact_table = fact_table.merge(dim_date.rename(columns = {'date_id' : 'order_date_id'}), left_on=['Order_Date_conv'], right_on=['date'])
fact_table = fact_table.merge(dim_payment_mode, left_on=['PaymentMode'], right_on=['payment_mode'])
fact_table = fact_table.merge(dim_location, left_on=['State', 'City'], right_on=['state', 'city'])
fact_table.head()

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode,Order Date,CustomerName,State,...,date,order_date_id,year,quarter,month,payment_mode,payment_mode_id,state,city,location_id
0,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2023-06-27,David Padilla,Florida,...,2023-06-27,1,2023,2,6,UPI,1,Florida,Miami,1
1,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2024-12-27,Connor Morgan,Illinois,...,2024-12-27,2,2024,4,12,UPI,1,Illinois,Chicago,2
2,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2021-07-25,Robert Stone,New York,...,2021-07-25,3,2021,3,7,UPI,1,New York,Buffalo,3
3,B-26776,4975,1330,14,Electronics,Printers,UPI,2023-06-27,David Padilla,Florida,...,2023-06-27,1,2023,2,6,UPI,1,Florida,Miami,1
4,B-26776,4975,1330,14,Electronics,Printers,UPI,2024-12-27,Connor Morgan,Illinois,...,2024-12-27,2,2024,4,12,UPI,1,Illinois,Chicago,2

In [169]:
fact_table.columns

Index(['Order ID', 'Amount', 'Profit', 'Quantity', 'Category', 'Sub-Category',
       'PaymentMode', 'Order Date', 'CustomerName', 'State', 'City',
       'Year-Month', 'Order_Date_conv', 'customer_name', 'customer_id',
       'sub_category', 'category', 'product_id', 'date', 'order_date_id',
       'year', 'quarter', 'month', 'payment_mode', 'payment_mode_id', 'state',
       'city', 'location_id'],
      dtype='object')

In [170]:
fact_table = fact_table[['Order ID', 'Amount', 'Profit', 'Quantity', 'customer_id', 'product_id', 'order_date_id', 'payment_mode_id', 'location_id']]

In [171]:
fact_table.head()

,Order ID,Amount,Profit,Quantity,customer_id,product_id,order_date_id,payment_mode_id,location_id
0,B-26776,9726,1275,5,1,1,1,1,1
1,B-26776,9726,1275,5,2,1,2,1,2
2,B-26776,9726,1275,5,3,1,3,1,3
3,B-26776,4975,1330,14,1,2,1,1,1
4,B-26776,4975,1330,14,2,2,2,1,2

In [176]:
fact_table = fact_table.rename(columns = {'Order ID' : 'order_id', 'Amount' : 'amount', 'Profit' : 'profit', 'Quantity' : 'quantity'})
fact_table['id'] = fact_table.index + 1

In [177]:
fact_table.head()

,order_id,amount,profit,quantity,customer_id,product_id,order_date_id,payment_mode_id,location_id,id
0,B-26776,9726,1275,5,1,1,1,1,1,1
1,B-26776,9726,1275,5,2,1,2,1,2,2
2,B-26776,9726,1275,5,3,1,3,1,3,3
3,B-26776,4975,1330,14,1,2,1,1,1,4
4,B-26776,4975,1330,14,2,2,2,1,2,5

### Load ###

In [190]:
tables = {
    'fact_sales' : fact_table
    ,'dim_customer' : dim_customer
    ,'dim_product' : dim_product
    ,'dim_date' : dim_date
    ,'dim_location' : dim_location
    ,'dim_payment_mode' : dim_payment_mode
}

In [195]:
from sqlalchemy import create_engine, text
from sqlalchemy.exc import SQLAlchemyError

In [184]:
engine = create_engine('postgresql+psycopg2://dominika:Pg1sW7hjQ!@localhost:5432/sales_dw')

In [209]:
for tab_name, tab in tables.items():
    try:
        with engine.connect() as connection:
            with connection.begin():
                tab.to_sql(
                    tab_name,
                    con=connection,
                    if_exists='replace',
                    index=True
                )
            rows_check = connection.execute(text(f"select count(*) from {tab_name}"))
            for row in rows_check:
                if len(tab) != row[0]: print(f"Number of rows in {tab_name} is not correct")

    except SQLAlchemyError as e:
        print(f"Database error: {e}")

In [210]:
engine.dispose()